# 1)


lst = [1, 2, 3]
lst.append(4) 

# extend()  ამატებს სხვა სიის ყველა ელემენტს
lst.extend([5, 6])  # [1, 2, 3, 4, 5, 6]

# insert()  ამატებს ელემენტს მითითებულ ინდექსზე
lst.insert(1, 10)  # [1, 10, 2, 3, 4, 5, 6]

# remove()  შლის პირველივე მითითებულ მნიშვნელობას
lst.remove(10)  # [1, 2, 3, 4, 5, 6]

# pop()  შლის და აბრუნებს ელემენტს მითითებული ინდექსით (ან ბოლო ელემენტს)
lst.pop()  # აბრუნებს 6, სია ხდება [1, 2, 3, 4, 5]

# index()  აბრუნებს ელემენტის ინდექსს
lst.index(3)  # 2

# count()  ითვლის რამდენჯერ გვხვდება ელემენტი
lst.count(2)  # 1
